app/Controllers/Obat.php

    public function data_obat()
    {
        $currentPage = $this->request->getVar('page_pasien') ?
            $this->request->getVar('page_pasien') : 1;

        // kata kunci search
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $obat = $this->obatModel->search($keyword);
        } else {
            $obat = $this->obatModel->getObat();
        }

        $data = [
            'detail'        => 'obat',
            'obat'          => $obat->paginate(7, 'obat'),
---
SELECT COUNT(*) AS `numrows`
FROM `obat`