app/Controllers/Obat.php

    public function save()
    {
        // deklarasi inputan
        $nama = $this->request->getVar('nama_obat');
        $jenis = $this->request->getVar('jenis');
        $jumlah = $this->request->getVar('jumlah_obat');
        $date = $this->request->getVar('expired_date');

        // save dengan model
        $this->obatModel->save([
            'nama_obat'     => $nama,
            'jumlah_obat'   => $jumlah,
            'expired_date'  => $date,
            'jenis_obat'    => $jenis
        ]);
---
INSERT INTO `obat` (`nama_obat`, `jumlah_obat`, `expired_date`, `jenis_obat`) VALUES ('Antimo', '20', '2022-11-17', 'Sendok')

    public function data_obat()
    {
        $currentPage = $this->request->getVar('page_pasien') ?
            $this->request->getVar('page_pasien') : 1;

        // kata kunci search
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $obat = $this->obatModel->search($keyword);
        } else {
            $obat = $this->obatModel->getObat();
        }

        $data = [
            'detail'        => 'obat',
            'obat'          => $obat->paginate(7, 'obat'),
---
SELECT COUNT(*) AS `numrows`
FROM `obat`