app/Models/ObatModel.php

SELECT *
FROM `obat`
WHERE `id_obat` = '41'
 LIMIT 1
---
    public function getObat($id = false)
    {
        if ($id == false) {
            return $this->table('obat')->orderBy('id_obat', 'DESC');
        }

        return $this->where(['id_obat' => $id])->first();

SELECT *
FROM `obat`
WHERE `nama_obat` = 'Antimo'
 LIMIT 1
---
    public function cariObat($key)
    {

        return $this->where(['nama_obat' => $key])->first();